betfair/templates/global/BFGlobalService.createAccount.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/global/v3/'
xmlns:ns1='http://www.betfair.com/publicapi/v3/BFGlobalService/'>
<SOAP-ENV:Body>
<ns1:createAccount>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<acceptedPrivicyPolicyVersion>0</acceptedPrivicyPolicyVersion>
<acceptedTermsAndConditionsVersion>0</acceptedTermsAndConditionsVersion>
<accountType>STANDARD</accountType>
<address1></address1>
<address2></address2>
<address3></address3>
<answer1></answer1>
<answer2></answer2>
<browser></browser>
<countryOfResidence></countryOfResidence>
<countyState></countyState>
<currency></currency>
<dateOfBirth>2012-05-16T18:47:04Z</dateOfBirth>
<depositLimit>0.0</depositLimit>
<depositLimitFrequency>DAILY</depositLimitFrequency>
<emailAddress></emailAddress>
<firstName></firstName>
<gender>M</gender>
<homeTelephone></homeTelephone>
<informProductsServices>false</informProductsServices>
<informSpecialOffers>false</informSpecialOffers>
<ipAddress></ipAddress>
<locale></locale>
<lossLimit>0.0</lossLimit>
<lossLimitFrequency>DAILY</lossLimitFrequency>
<manualAddress>false</manualAddress>
<mobileTelephone></mobileTelephone>
<partnerId>0</partnerId>
<password></password>
<postCode></postCode>
<preferredName></preferredName>
<productId>0</productId>
<question1>SQ1A</question1>
<question2>SQ2A</question2>
<referrerCode></referrerCode>
<region>ZAF</region>
<subPartnerId>0</subPartnerId>
<superPartnerId>0</superPartnerId>
<surname></surname>
<timeZone></timeZone>
<title>Dr</title>
<townCity></townCity>
<username></username>
<workTelephone></workTelephone>
<nationalIdentifier></nationalIdentifier>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:createAccount>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
